RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_sdioc.h
/**
 *******************************************************************************
 * @file  hc32f4a0_sdioc.h
 * @brief This file contains all the functions prototypes of the SDIOC driver
 *        library.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Yangjp          First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
#ifndef __HC32F4A0_SDIOC_H__
#define __HC32F4A0_SDIOC_H__

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_common.h"
#include "ddl_config.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @addtogroup DDL_SDIOC
 * @{
 */

#if (DDL_SDIOC_ENABLE == DDL_ON)

/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup SDIOC_Global_Types SDIOC Global Types
 * @{
 */

/**
 * @brief SDIOC Init structure definition
 */
typedef struct
{
    uint32_t u32Mode;                         /*!< Specifies the SDIOC work mode.
                                                   This parameter can be a value of @ref SDIOC_Mode */

    uint8_t  u8CardDetectSelect;              /*!< Specifies the SDIOC card detect source select.
                                                   This parameter can be a value of @ref SDIOC_Card_Detect_Select */

    uint8_t  u8SpeedMode;                     /*!< Specifies the SDIOC speed mode.
                                                   This parameter can be a value of @ref SDIOC_Speed_Mode */

    uint8_t  u8BusWidth;                      /*!< Specifies the SDIOC bus width.
                                                   This parameter can be a value of @ref SDIOC_Bus_Width */

    uint16_t u16ClockDiv;                     /*!< Specifies the SDIOC clock division.
                                                   This parameter can be a value of @ref SDIOC_Clock_Division */
} stc_sdioc_init_t;

/**
 * @brief SDIOC Command Init structure definition
 */
typedef struct
{
    uint32_t u32Argument;                     /*!< Specifies the SDIOC command argument. */

    uint16_t u16CmdIndex;                     /*!< Specifies the SDIOC command index.
                                                   This parameter must be a number between Min_Data = 0 and Max_Data = 63 */

    uint16_t u16CmdType;                      /*!< Specifies the SDIOC command type.
                                                   This parameter can be a value of @ref SDIOC_Command_Type */

    uint16_t u16DataLineEn;                   /*!< Specifies whether SDIOC uses data lines in current command.
                                                   This parameter can be a value of @ref SDIOC_Data_Line_Valid */

    uint16_t u16RespType;                     /*!< Specifies the SDIOC response type.
                                                   This parameter can be a value of @ref SDIOC_Response_Type */
} stc_sdioc_cmd_init_t;

/**
 * @brief SDIOC Data Init structure definition
 */
typedef struct
{
    uint16_t u16BlockSize;                    /*!< Specifies the SDIOC data block size.
                                                   This parameter must be a number between Min_Data = 1 and Max_Data = 512 */

    uint16_t u16BlockCount;                   /*!< Specifies the SDIOC data block count.
                                                   This parameter must be a number between Min_Data = 0 and Max_Data = 0xFFFF */

    uint16_t u16TransferDir;                  /*!< Specifies the SDIOC data transfer direction.
                                                   This parameter can be a value of @ref SDIOC_Transfer_Direction */

    uint16_t u16AutoCMD12En;                  /*!< Specifies the validity of the SDIOC Auto Send CMD12.
                                                   This parameter can be a value of @ref SDIOC_Auto_Send_CMD12 */

    uint16_t u16TransferMode;                 /*!< Specifies the SDIOC data transfer mode.
                                                   This parameter can be a value of @ref SDIOC_Transfer_Mode */

    uint8_t  u16DataTimeout;                  /*!< Specifies the SDIOC data timeout time.
                                                   This parameter can be a value of @ref SDIOC_Data_Timeout_Time */
} stc_sdioc_data_init_t;


/**
 * @}
 */

/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup SDIOC_Global_Macros SDIOC Global Macros
 * @{
 */

/**
 * @defgroup SDIOC_Mode SDIOC Mode
 * @{
 */
#define SDIOC_MODE_SD                           (0x00UL)              /*!< SDIOCx selects SD mode  */
#define SDIOC_MODE_MMC                          (0x01UL)              /*!< SDIOCx selects MMC mode */
/**
 * @}
 */

/**
 * @defgroup SDIOC_Card_Detect_Select SDIOC Card Detect Select
 * @{
 */
#define SDIOC_CARD_DETECT_CD_PIN_LEVEL          (0x00U)               /*!< SDIOCx_CD(x=1~2) line is selected (for normal use)       */
#define SDIOC_CARD_DETECT_TEST_SIGNAL           (SDIOC_HOSTCON_CDSS)  /*!< The Card Detect Test Level is selected(for test purpose) */
/**
 * @}
 */

/**
 * @defgroup SDIOC_Card_Detect_Test_Level SDIOC Card Detect Test Level
 * @{
 */
#define SDIOC_CARD_DETECT_TEST_LEVEL_LOW        (0x00U)               /*!< Card identification test signal is low level (with device insertion) */
#define SDIOC_CARD_DETECT_TEST_LEVEL_HIGH       (SDIOC_HOSTCON_CDTL)  /*!< Card identification test signal is high level (no device insertion)  */
/**
 * @}
 */

/**
 * @defgroup SDIOC_Speed_Mode SDIOC Speed Mode
 * @{
 */
#define SDIOC_SPEED_MODE_NORMAL                 (0x00U)               /*!< Normal speed mode */
#define SDIOC_SPEED_MODE_HIGH                   (SDIOC_HOSTCON_HSEN)  /*!< High speed mode   */
/**
 * @}
 */

/**
 * @defgroup SDIOC_Bus_Width SDIOC Bus Width
 * @{
 */
#define SDIOC_BUS_WIDTH_1BIT                    (0x00U)               /*!< The Bus width is 1 bit */
#define SDIOC_BUS_WIDTH_4BIT                    (SDIOC_HOSTCON_DW)    /*!< The Bus width is 4 bit */
#define SDIOC_BUS_WIDTH_8BIT                    (SDIOC_HOSTCON_EXDW)  /*!< The Bus width is 8 bit */
/**
 * @}
 */

/**
 * @defgroup SDIOC_Clock_Division SDIOC Clock Division
 * @{
 */
#define SDIOC_CLOCK_DIV_1                       (0x00U)               /*!< PCLK1/1   */
#define SDIOC_CLOCK_DIV_2                       (SDIOC_CLKCON_FS_0)   /*!< PCLK1/2   */
#define SDIOC_CLOCK_DIV_4                       (SDIOC_CLKCON_FS_1)   /*!< PCLK1/4   */
#define SDIOC_CLOCK_DIV_8                       (SDIOC_CLKCON_FS_2)   /*!< PCLK1/8   */
#define SDIOC_CLOCK_DIV_16                      (SDIOC_CLKCON_FS_3)   /*!< PCLK1/16  */
#define SDIOC_CLOCK_DIV_32                      (SDIOC_CLKCON_FS_4)   /*!< PCLK1/32  */
#define SDIOC_CLOCK_DIV_64                      (SDIOC_CLKCON_FS_5)   /*!< PCLK1/64  */
#define SDIOC_CLOCK_DIV_128                     (SDIOC_CLKCON_FS_6)   /*!< PCLK1/128 */
#define SDIOC_CLOCK_DIV_256                     (SDIOC_CLKCON_FS_7)   /*!< PCLK1/256 */
/**
 * @}
 */

/**
 * @defgroup SDIOC_Command_Type SDIOC Command Type
 * @{
 */
#define SDIOC_CMD_TYPE_NORMAL                   (0x00U)               /*!< Other commands                               */
#define SDIOC_CMD_TYPE_SUSPEND                  (SDIOC_CMD_TYP_0)     /*!< CMD52 for writing "Bus Suspend" in CCCR      */
#define SDIOC_CMD_TYPE_RESUME                   (SDIOC_CMD_TYP_1)     /*!< CMD52 for writing "Function Select" in CCCR  */
#define SDIOC_CMD_TYPE_ABORT                    (SDIOC_CMD_TYP)       /*!< CMD12, CMD52 for writing "I/O Abort" in CCCR */
/**
 * @}
 */

/**
 * @defgroup SDIOC_Data_Line_Valid SDIOC Data Line Valid
 * @{
 */
#define SDIOC_DATA_LINE_DISABLE                 (0x00U)               /*!< The current command uses only SDIOCx_CMD(x=1~2) command line       */
#define SDIOC_DATA_LINE_ENABLE                  (SDIOC_CMD_DAT)       /*!< The current command requires the use of SDIOCx_Dy(x=1~2) data line */
/**
 * @}
 */

/**
 * @defgroup SDIOC_Transfer_Direction SDIOC Transfer Direction
 * @{
 */
#define SDIOC_TRANSFER_DIR_TO_CARD              (0x00U)                 /*!< Write (Host to Card) */
#define SDIOC_TRANSFER_DIR_TO_HOST              (SDIOC_TRANSMODE_DDIR)  /*!< Read (Card to Host)  */
/**
 * @}
 */

/**
 * @defgroup SDIOC_Auto_Send_CMD12 SDIOC Auto Send CMD12
 * @{
 */
#define SDIOC_AUTO_SEND_CMD12_DISABLE           (0x00U)                    /*!< Do not send autocommands                                   */
#define SDIOC_AUTO_SEND_CMD12_ENABLE            (SDIOC_TRANSMODE_ATCEN_0)  /*!< CMD12 is automatically sent after multiple block transfers */
/**
 * @}
 */

/**
 * @defgroup SDIOC_Transfer_Mode SDIOC Transfer Mode
 * @{
 */
#define SDIOC_TRANSFER_MODE_SINGLE              (0x00U)                                       /*!< Single Block transfer        */
#define SDIOC_TRANSFER_MODE_INFINITE            (SDIOC_TRANSMODE_MULB)                        /*!< Infinite Block transfer      */
#define SDIOC_TRANSFER_MODE_MULTIPLE            (SDIOC_TRANSMODE_MULB | SDIOC_TRANSMODE_BCE)  /*!< Multiple Block transfer      */
#define SDIOC_TRANSFER_MODE_STOP_MULTIPLE       (0x8000U | SDIOC_TRANSFER_MODE_MULTIPLE)      /*!< Stop Multiple Block transfer */
/**
 * @}
 */

/**
 * @defgroup SDIOC_Data_Timeout_Time SDIOC Data Timeout Time
 * @{
 */
#define SDIOC_DATA_TIMEOUT_CLK_2_13             (0x00U)  /*!< Timeout time: PCLK1*2^13 */
#define SDIOC_DATA_TIMEOUT_CLK_2_14             (0x01U)  /*!< Timeout time: PCLK1*2^14 */
#define SDIOC_DATA_TIMEOUT_CLK_2_15             (0x02U)  /*!< Timeout time: PCLK1*2^15 */
#define SDIOC_DATA_TIMEOUT_CLK_2_16             (0x03U)  /*!< Timeout time: PCLK1*2^16 */
#define SDIOC_DATA_TIMEOUT_CLK_2_17             (0x04U)  /*!< Timeout time: PCLK1*2^17 */
#define SDIOC_DATA_TIMEOUT_CLK_2_18             (0x05U)  /*!< Timeout time: PCLK1*2^18 */
#define SDIOC_DATA_TIMEOUT_CLK_2_19             (0x06U)  /*!< Timeout time: PCLK1*2^19 */
#define SDIOC_DATA_TIMEOUT_CLK_2_20             (0x07U)  /*!< Timeout time: PCLK1*2^20 */
#define SDIOC_DATA_TIMEOUT_CLK_2_21             (0x08U)  /*!< Timeout time: PCLK1*2^21 */
#define SDIOC_DATA_TIMEOUT_CLK_2_22             (0x09U)  /*!< Timeout time: PCLK1*2^22 */
#define SDIOC_DATA_TIMEOUT_CLK_2_23             (0x0AU)  /*!< Timeout time: PCLK1*2^23 */
#define SDIOC_DATA_TIMEOUT_CLK_2_24             (0x0BU)  /*!< Timeout time: PCLK1*2^24 */
#define SDIOC_DATA_TIMEOUT_CLK_2_25             (0x0CU)  /*!< Timeout time: PCLK1*2^25 */
#define SDIOC_DATA_TIMEOUT_CLK_2_26             (0x0DU)  /*!< Timeout time: PCLK1*2^26 */
#define SDIOC_DATA_TIMEOUT_CLK_2_27             (0x0EU)  /*!< Timeout time: PCLK1*2^27 */
/**
 * @}
 */

/**
 * @defgroup SDIOC_Response_Register SDIOC Response Register
 * @{
 */
#define SDIOC_RESPONSE_REG_BIT0_31              (0x00U)  /*!< Command Response Register 0-31bit   */
#define SDIOC_RESPONSE_REG_BIT32_63             (0x04U)  /*!< Command Response Register 32-63bit  */
#define SDIOC_RESPONSE_REG_BIT64_95             (0x08U)  /*!< Command Response Register 64-95bit  */
#define SDIOC_RESPONSE_REG_BIT96_127            (0x0CU)  /*!< Command Response Register 96-127bit */
/**
 * @}
 */

/**
 * @defgroup SDIOC_Software_Reset_Type SDIOC_Software_Reset_Type
 * @{
 */
#define SDIOC_SW_RESET_DATA_LINE                (SDIOC_SFTRST_RSTD)  /*!< Only part of data circuit is reset                                     */
#define SDIOC_SW_RESET_CMD_LINE                 (SDIOC_SFTRST_RSTC)  /*!< Only part of command circuit is reset                                  */
#define SDIOC_SW_RESET_ALL                      (SDIOC_SFTRST_RSTA)  /*!< Reset the entire Host Controller except for the card detection circuit */
/**
 * @}
 */

/**
 * @defgroup SDIOC_Output_Clock_Frequency SDIOC Output Clock Frequency
 * @{
 */
#define SDIOC_OUTPUT_CLK_FREQ_400K              (400000UL)    /*!< SDIOC clock: 400KHz */
#define SDIOC_OUTPUT_CLK_FREQ_25M               (25000000UL)  /*!< SDIOC clock: 25MHz  */
#define SDIOC_OUTPUT_CLK_FREQ_26M               (26000000UL)  /*!< SDIOC clock: 26MHz  */
#define SDIOC_OUTPUT_CLK_FREQ_50M               (50000000UL)  /*!< SDIOC clock: 50MHz  */
#define SDIOC_OUTPUT_CLK_FREQ_52M               (52000000UL)  /*!< SDIOC clock: 52MHz  */
/**
 * @}
 */

/**
 * @defgroup SDIOC_Host_Status SDIOC Host Status
 * @{
 */
#define SDIOC_HOST_FLAG_CMDL                    (SDIOC_PSTAT_CMDL)    /*!< CMD Line Level status            */
#define SDIOC_HOST_FLAG_DATL                    (SDIOC_PSTAT_DATL)    /*!< DAT[3:0] Line Level status       */
#define SDIOC_HOST_FLAG_DATL_D0                 (SDIOC_PSTAT_DATL_0)  /*!< DAT[0] Line Level status         */
#define SDIOC_HOST_FLAG_DATL_D1                 (SDIOC_PSTAT_DATL_1)  /*!< DAT[1] Line Level status         */
#define SDIOC_HOST_FLAG_DATL_D2                 (SDIOC_PSTAT_DATL_2)  /*!< DAT[2] Line Level status         */
#define SDIOC_HOST_FLAG_DATL_D3                 (SDIOC_PSTAT_DATL_3)  /*!< DAT[3] Line Level status         */
#define SDIOC_HOST_FLAG_WPL                     (SDIOC_PSTAT_WPL)     /*!< Write Protect Line Level status  */
#define SDIOC_HOST_FLAG_CDL                     (SDIOC_PSTAT_CDL)     /*!< Card Detect Line Level status    */
#define SDIOC_HOST_FLAG_CSS                     (SDIOC_PSTAT_CSS)     /*!< Device Stable Status             */
#define SDIOC_HOST_FLAG_CIN                     (SDIOC_PSTAT_CIN)     /*!< Device Inserted status           */
#define SDIOC_HOST_FLAG_BRE                     (SDIOC_PSTAT_BRE)     /*!< Data buffer full status          */
#define SDIOC_HOST_FLAG_BWE                     (SDIOC_PSTAT_BWE)     /*!< Data buffer empty status         */
#define SDIOC_HOST_FLAG_RTA                     (SDIOC_PSTAT_RTA)     /*!< Read operation status            */
#define SDIOC_HOST_FLAG_WTA                     (SDIOC_PSTAT_WTA)     /*!< Write operation status           */
#define SDIOC_HOST_FLAG_DA                      (SDIOC_PSTAT_DA)      /*!< DAT Line transfer status         */
#define SDIOC_HOST_FLAG_CID                     (SDIOC_PSTAT_CID)     /*!< Command Inhibit with data status */
#define SDIOC_HOST_FLAG_CIC                     (SDIOC_PSTAT_CIC)     /*!< Command Inhibit status           */
/**
 * @}
 */

/**
 * @defgroup SDIOC_Normal_Error_Interrupt_Status SDIOC Normal Error Interrupt Status
 * @{
 */
#define SDIOC_NORMAL_INT_FLAG_EI                (SDIOC_NORINTST_EI)     /*!< Error Interrupt Status     */
#define SDIOC_NORMAL_INT_FLAG_CINT              (SDIOC_NORINTST_CINT)   /*!< Card Interrupt status      */
#define SDIOC_NORMAL_INT_FLAG_CRM               (SDIOC_NORINTST_CRM)    /*!< Card Removal status        */
#define SDIOC_NORMAL_INT_FLAG_CIST              (SDIOC_NORINTST_CIST)   /*!< Card Insertion status      */
#define SDIOC_NORMAL_INT_FLAG_BRR               (SDIOC_NORINTST_BRR)    /*!< Buffer Read Ready status   */
#define SDIOC_NORMAL_INT_FLAG_BWR               (SDIOC_NORINTST_BWR)    /*!< Buffer Write Ready status  */
#define SDIOC_NORMAL_INT_FLAG_BGE               (SDIOC_NORINTST_BGE)    /*!< Block Gap Event status     */
#define SDIOC_NORMAL_INT_FLAG_TC                (SDIOC_NORINTST_TC)     /*!< Transfer Complete status   */
#define SDIOC_NORMAL_INT_FLAG_CC                (SDIOC_NORINTST_CC)     /*!< Command Complete status    */
#define SDIOC_ERROR_INT_FLAG_ACE                ((uint32_t)SDIOC_ERRINTST_ACE  << 16U)  /*!< Auto CMD12 Error Status      */
#define SDIOC_ERROR_INT_FLAG_DEBE               ((uint32_t)SDIOC_ERRINTST_DEBE << 16U)  /*!< Data End Bit Error status    */
#define SDIOC_ERROR_INT_FLAG_DCE                ((uint32_t)SDIOC_ERRINTST_DCE  << 16U)  /*!< Data CRC Error status        */
#define SDIOC_ERROR_INT_FLAG_DTOE               ((uint32_t)SDIOC_ERRINTST_DTOE << 16U)  /*!< Data Timeout Error status    */
#define SDIOC_ERROR_INT_FLAG_CIE                ((uint32_t)SDIOC_ERRINTST_CIE  << 16U)  /*!< Command Index Error status   */
#define SDIOC_ERROR_INT_FLAG_CEBE               ((uint32_t)SDIOC_ERRINTST_CEBE << 16U)  /*!< Command End Bit Error status */
#define SDIOC_ERROR_INT_FLAG_CCE                ((uint32_t)SDIOC_ERRINTST_CCE  << 16U)  /*!< Command CRC Error status     */
#define SDIOC_ERROR_INT_FLAG_CTOE               ((uint32_t)SDIOC_ERRINTST_CTOE << 16U)  /*!< Command Timeout Error status */
#define SDIOC_ERROR_INT_STATIC_FLAGS            ((uint32_t)SDIOC_ERROR_INT_FLAG_ACE | SDIOC_ERROR_INT_FLAG_DEBE | \
                                                           SDIOC_ERROR_INT_FLAG_DCE | SDIOC_ERROR_INT_FLAG_DTOE | \
                                                           SDIOC_ERROR_INT_FLAG_CIE | SDIOC_ERROR_INT_FLAG_CEBE | \
                                                           SDIOC_ERROR_INT_FLAG_CCE | SDIOC_ERROR_INT_FLAG_CTOE | \
                                                           SDIOC_NORMAL_INT_FLAG_TC | SDIOC_NORMAL_INT_FLAG_CC)
/**
 * @}
 */

/**
 * @defgroup SDIOC_Normal_Error_Interrupt SDIOC Normal Error Interrupt
 * @{
 */
#define SDIOC_NORMAL_INT_CINTSEN                (SDIOC_NORINTSGEN_CINTSEN)   /*!< Card Interrupt                */
#define SDIOC_NORMAL_INT_CRMSEN                 (SDIOC_NORINTSGEN_CRMSEN)    /*!< Card Removal Interrupt        */
#define SDIOC_NORMAL_INT_CISTSEN                (SDIOC_NORINTSGEN_CISTSEN)   /*!< Card Insertion Interrupt      */
#define SDIOC_NORMAL_INT_BRRSEN                 (SDIOC_NORINTSGEN_BRRSEN)    /*!< Buffer Read Ready Interrupt   */
#define SDIOC_NORMAL_INT_BWRSEN                 (SDIOC_NORINTSGEN_BWRSEN)    /*!< Buffer Write Ready Interrupt  */
#define SDIOC_NORMAL_INT_BGESEN                 (SDIOC_NORINTSGEN_BGESEN)    /*!< Block Gap Event Interrupt     */
#define SDIOC_NORMAL_INT_TCSEN                  (SDIOC_NORINTSGEN_TCSEN)     /*!< Transfer Complete Interrupt   */
#define SDIOC_NORMAL_INT_CCSEN                  (SDIOC_NORINTSGEN_CCSEN)     /*!< Command Complete Interrupt    */
#define SDIOC_ERROR_INT_ACESEN                  ((uint32_t)SDIOC_ERRINTSGEN_ACESEN  << 16U)   /*!< Auto CMD12 Error Interrupt      */
#define SDIOC_ERROR_INT_DEBESEN                 ((uint32_t)SDIOC_ERRINTSGEN_DEBESEN << 16U)   /*!< Data End Bit Error Interrupt    */
#define SDIOC_ERROR_INT_DCESEN                  ((uint32_t)SDIOC_ERRINTSGEN_DCESEN  << 16U)   /*!< Data CRC Error Interrupt        */
#define SDIOC_ERROR_INT_DTOESEN                 ((uint32_t)SDIOC_ERRINTSGEN_DTOESEN << 16U)   /*!< Data Timeout Error Interrupt    */
#define SDIOC_ERROR_INT_CIESEN                  ((uint32_t)SDIOC_ERRINTSGEN_CIESEN  << 16U)   /*!< Command Index Error Interrupt   */
#define SDIOC_ERROR_INT_CEBESEN                 ((uint32_t)SDIOC_ERRINTSGEN_CEBESEN << 16U)   /*!< Command End Bit Error Interrupt */
#define SDIOC_ERROR_INT_CCESEN                  ((uint32_t)SDIOC_ERRINTSGEN_CCESEN  << 16U)   /*!< Command CRC Error Interrupt     */
#define SDIOC_ERROR_INT_CTOESEN                 ((uint32_t)SDIOC_ERRINTSGEN_CTOESEN << 16U)   /*!< Command Timeout Error Interrupt */
/**
 * @}
 */

/**
 * @defgroup SDIOC_Auto_CMD_Error_Status SDIOC Auto CMD Error Status
 * @{
 */
#define SDIOC_AUTO_CMD_ERROR_FLAG_CMDE          (SDIOC_ATCERRST_CMDE)   /*!< Command Not Issued By Auto CMD12 Error Status  */
#define SDIOC_AUTO_CMD_ERROR_FLAG_IE            (SDIOC_ATCERRST_IE)     /*!< Auto CMD12 Index Error status                  */
#define SDIOC_AUTO_CMD_ERROR_FLAG_EBE           (SDIOC_ATCERRST_EBE)    /*!< Auto CMD12 End Bit Error status                */
#define SDIOC_AUTO_CMD_ERROR_FLAG_CE            (SDIOC_ATCERRST_CE)     /*!< Auto CMD12 CRC Error status                    */
#define SDIOC_AUTO_CMD_ERROR_FLAG_TOE           (SDIOC_ATCERRST_TOE)    /*!< Auto CMD12 Timeout Error status                */
#define SDIOC_AUTO_CMD_ERROR_FLAG_NE            (SDIOC_ATCERRST_NE)     /*!< Auto CMD12 Not Executed status                 */
/**
 * @}
 */

/**
 * @defgroup SDIOC_Force_Auto_CMD_Error SDIOC Force Auto CMD Error
 * @{
 */
#define SDIOC_FORCE_AUTO_CMD_ERROR_FCMDE        (SDIOC_FEA_FCMDE)   /*!< Force Event for Command Not Issued By Auto CMD12 Error */
#define SDIOC_FORCE_AUTO_CMD_ERROR_FIE          (SDIOC_FEA_FIE)     /*!< Force Event for Auto CMD12 Index Error                 */
#define SDIOC_FORCE_AUTO_CMD_ERROR_FEBE         (SDIOC_FEA_FEBE)    /*!< Force Event for Auto CMD12 End Bit Error               */
#define SDIOC_FORCE_AUTO_CMD_ERROR_FCE          (SDIOC_FEA_FCE)     /*!< Force Event for Auto CMD12 CRC Error                   */
#define SDIOC_FORCE_AUTO_CMD_ERROR_FTOE         (SDIOC_FEA_FTOE)    /*!< Force Event for Auto CMD12 Timeout Error               */
#define SDIOC_FORCE_AUTO_CMD_ERROR_FNE          (SDIOC_FEA_FNE)     /*!< Force Event for Auto CMD12 Not Executed                */
/**
 * @}
 */

/**
 * @defgroup SDIOC_Force_Error_Interrupt SDIOC Force Error Interrupt
 * @{
 */
#define SDIOC_FORCE_ERROR_INT_FACE              (SDIOC_FEE_FACE)    /*!< Force Event for Auto CMD12 Error       */
#define SDIOC_FORCE_ERROR_INT_FDEBE             (SDIOC_FEE_FDEBE)   /*!< Force Event for Data End Bit Error     */
#define SDIOC_FORCE_ERROR_INT_FDCE              (SDIOC_FEE_FDCE)    /*!< Force Event for Data CRC Error         */
#define SDIOC_FORCE_ERROR_INT_FDTOE             (SDIOC_FEE_FDTOE)   /*!< Force Event for Data Timeout Error     */
#define SDIOC_FORCE_ERROR_INT_FCIE              (SDIOC_FEE_FCIE)    /*!< Force Event for Command Index Error    */
#define SDIOC_FORCE_ERROR_INT_FCEBE             (SDIOC_FEE_FCEBE)   /*!< Force Event for Command End Bit Error  */
#define SDIOC_FORCE_ERROR_INT_FCCE              (SDIOC_FEE_FCCE)    /*!< Force Event for Command CRC Error      */
#define SDIOC_FORCE_ERROR_INT_FCTOE             (SDIOC_FEE_FCTOE)   /*!< Force Event for Command Timeout Error  */
/**
 * @}
 */

/**
 * @defgroup SDIOC_Response_Type SDIOC Response Type
 * @{
 */
#define SDIOC_RESOPNE_TYPE_NO                   (0x00U)                                               /*!< No Response                        */
#define SDIOC_RESOPNE_TYPE_R2                   (SDIOC_CMD_RESTYP_0 | SDIOC_CMD_CCE)                  /*!< Command Response 2                 */
#define SDIOC_RESOPNE_TYPE_R3_R4                (SDIOC_CMD_RESTYP_1)                                  /*!< Command Response 3, 4              */
#define SDIOC_RESOPNE_TYPE_R1_R5_R6_R7          (SDIOC_CMD_RESTYP_1 | SDIOC_CMD_ICE | SDIOC_CMD_CCE)  /*!< Command Response 1, 5, 6, 7        */
#define SDIOC_RESOPNE_TYPE_R1B_R5B              (SDIOC_CMD_RESTYP   | SDIOC_CMD_ICE | SDIOC_CMD_CCE)  /*!< Command Response 1 and 5 with busy */
/**
 * @}
 */

