RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_sdioc.h
/**
 * @defgroup SDIOC_Commands_Index SDIOC Commands Index
 * @{
 */
#define SDIOC_CMD0_GO_IDLE_STATE                (0U)   /*!< Resets the SD memory card. */
#define SDIOC_CMD1_SEND_OP_COND                 (1U)   /*!< Sends host capacity support information and activates the card's initialization process. */
#define SDIOC_CMD2_ALL_SEND_CID                 (2U)   /*!< Asks any card connected to the host to send the CID numbers on the CMD line.             */
#define SDIOC_CMD3_SEND_RELATIVE_ADDR           (3U)   /*!< Asks the card to publish a new relative address (RCA).                                   */
#define SDIOC_CMD4_SET_DSR                      (4U)   /*!< Programs the DSR of all cards.                                                           */
#define SDIOC_CMD5_IO_SEND_OP_COND              (5U)   /*!< Sends host capacity support information (HCS) and asks the accessed card to send its \
                                                            operating condition register (OCR) content in the response on the CMD line.              */
#define SDIOC_CMD6_SWITCH_FUNC                  (6U)   /*!< Checks switchable function (mode 0) and switch card function (mode 1).                   */
#define SDIOC_CMD7_SELECT_DESELECT_CARD         (7U)   /*!< Selects the card by its own relative address and gets deselected by any other address    */
#define SDIOC_CMD8_SEND_IF_COND                 (8U)   /*!< Sends SD Memory Card interface condition, which includes host supply voltage information \
                                                            and asks the card whether card supports voltage.                                         */
#define SDIOC_CMD9_SEND_CSD                     (9U)   /*!< Addressed card sends its card specific data (CSD) on the CMD line.                       */
#define SDIOC_CMD10_SEND_CID                    (10U)  /*!< Addressed card sends its card identification (CID) on the CMD line.                      */
#define SDIOC_CMD11_READ_DAT_UNTIL_STOP         (11U)  /*!< SD card doesn't support it.                                                              */
#define SDIOC_CMD12_STOP_TRANSMISSION           (12U)  /*!< Forces the card to stop transmission.                                                    */
#define SDIOC_CMD13_SEND_STATUS                 (13U)  /*!< Addressed card sends its status register.                                                */
#define SDIOC_CMD14_HS_BUSTEST_READ             (14U)  /*!< Reserved                                                                                 */
#define SDIOC_CMD15_GO_INACTIVE_STATE           (15U)  /*!< Sends an addressed card into the inactive state.                                         */
#define SDIOC_CMD16_SET_BLOCKLEN                (16U)  /*!< Sets the block length (in bytes for SDSC) for all following block commands(read, write).  \
                                                            Default block length is fixed to 512 Bytes. Not effective for SDHS and SDXC.             */
#define SDIOC_CMD17_READ_SINGLE_BLOCK           (17U)  /*!< Reads single block of size selected by SET_BLOCKLEN in case of SDSC, and a block of fixed \
                                                            512 bytes in case of SDHC and SDXC.                                                      */
#define SDIOC_CMD18_READ_MULTIPLE_BLOCK         (18U)  /*!< Continuously transfers data blocks from card to host until interrupted by                 \
                                                            STOP_TRANSMISSION command.                                                               */
#define SDIOC_CMD19_HS_BUSTEST_WRITE            (19U)  /*!< 64 bytes tuning pattern is sent for SDR50 and SDR104.                                    */
#define SDIOC_CMD20_WRITE_DAT_UNTIL_STOP        (20U)  /*!< Speed class control command.                                                             */
#define SDIOC_CMD23_SET_BLOCK_COUNT             (23U)  /*!< Specify block count for CMD18 and CMD25.                                                 */
#define SDIOC_CMD24_WRITE_SINGLE_BLOCK          (24U)  /*!< Writes single block of size selected by SET_BLOCKLEN in case of SDSC, and a block of fixed\
                                                            512 bytes in case of SDHC and SDXC.                                                      */
#define SDIOC_CMD25_WRITE_MULTIPLE_BLOCK        (25U)  /*!< Continuously writes blocks of data until a STOP_TRANSMISSION follows.                    */
#define SDIOC_CMD26_PROGRAM_CID                 (26U)  /*!< Reserved for manufacturers.                                                              */
#define SDIOC_CMD27_PROGRAM_CSD                 (27U)  /*!< Programming of the programmable bits of the CSD.                                         */
#define SDIOC_CMD28_SET_WRITE_PROT              (28U)  /*!< Sets the write protection bit of the addressed group.                                    */
#define SDIOC_CMD29_CLR_WRITE_PROT              (29U)  /*!< Clears the write protection bit of the addressed group.                                  */
#define SDIOC_CMD30_SEND_WRITE_PROT             (30U)  /*!< Asks the card to send the status of the write protection bits.                           */
#define SDIOC_CMD32_ERASE_WR_BLK_START          (32U)  /*!< Sets the address of the first write block to be erased. (For SD card only).              */
#define SDIOC_CMD33_ERASE_WR_BLK_END            (33U)  /*!< Sets the address of the last write block of the continuous range to be erased.           */
#define SDIOC_CMD35_ERASE_GRP_START             (35U)  /*!< Sets the address of the first write block to be erased. Reserved for each command system  \
                                                            set by switch function command (CMD6).                                                   */
#define SDIOC_CMD36_ERASE_GRP_END               (36U)  /*!< Sets the address of the last write block of the continuous range to be erased.            \
                                                            Reserved for each command system set by switch function command (CMD6).                  */
#define SDIOC_CMD38_ERASE                       (38U)  /*!< Reserved for SD security applications.                                                   */
#define SDIOC_CMD39_FAST_IO                     (39U)  /*!< SD card doesn't support it (Reserved).                                                   */
#define SDIOC_CMD40_GO_IRQ_STATE                (40U)  /*!< SD card doesn't support it (Reserved).                                                   */
#define SDIOC_CMD42_LOCK_UNLOCK                 (42U)  /*!< Sets/resets the password or lock/unlock the card. The size of the data block is set by    \
                                                            the SET_BLOCK_LEN command.                                                               */
#define SDIOC_CMD55_APP_CMD                     (55U)  /*!< Indicates to the card that the next command is an application specific command rather     \
                                                            than a standard command.                                                                 */
#define SDIOC_CMD56_GEN_CMD                     (56U)  /*!< Used either to transfer a data block to the card or to get a data block from the card     \
                                                            for general purpose/application specific commands.                                       */
#define SDIOC_CMD64_NO_CMD                      (64U)  /*!< No command                                                                               */

/**
 * @brief Following commands are SD Card Specific commands.
 *        CMD55_APP_CMD should be sent before sending these commands.
 */
#define SDIOC_ACMD6_SET_BUS_WIDTH               (6U)   /*!< (ACMD6) Defines the data bus width to be used for data transfer. The allowed data bus     \
                                                            widths are given in SCR register.                                                        */
#define SDIOC_ACMD13_SD_STATUS                  (13U)  /*!< (ACMD13) Sends the SD status.                                                            */
#define SDIOC_ACMD22_SEND_NUM_WR_BLOCKS         (22U)  /*!< (ACMD22) Sends the number of the written (without errors) write blocks. Responds with     \
                                                            32bit+CRC data block.                                                                    */
#define SDIOC_ACMD41_SD_APP_OP_COND             (41U)  /*!< (ACMD41) Sends host capacity support information (HCS) and asks the accessed card to      \
                                                            send its operating condition register (OCR) content in the response on the CMD line.     */
#define SDIOC_ACMD42_SET_CLR_CARD_DETECT        (42U)  /*!< (ACMD42) Connect/Disconnect the 50 KOhm pull-up resistor on CD/DAT3 (pin 1) of the card  */
#define SDIOC_ACMD51_SEND_SCR                   (51U)  /*!< Reads the SD Configuration Register (SCR).                                               */
#define SDIOC_ACMD52_RW_DIRECT                  (52U)  /*!< For SD I/O card only, reserved for security specification.                               */
#define SDIOC_ACMD53_RW_EXTENDED                (53U)  /*!< For SD I/O card only, reserved for security specification.                               */

/**
 * @brief Following commands are SD Card Specific security commands.
 *        CMD55_APP_CMD should be sent before sending these commands.
 */
#define SDIOC_ACMD43_GET_MKB                        (43U)
#define SDIOC_ACMD44_GET_MID                        (44U)
#define SDIOC_ACMD45_SET_CER_RN1                    (45U)
#define SDIOC_ACMD46_GET_CER_RN2                    (46U)
#define SDIOC_ACMD47_SET_CER_RES2                   (47U)
#define SDIOC_ACMD48_GET_CER_RES1                   (48U)
#define SDIOC_ACMD18_SECURE_READ_MULTIPLE_BLOCK     (18U)
#define SDIOC_ACMD25_SECURE_WRITE_MULTIPLE_BLOCK    (25U)
#define SDIOC_ACMD38_SECURE_ERASE                   (38U)
#define SDIOC_ACMD49_CHANGE_SECURE_AREA             (49U)
#define SDIOC_ACMD48_SECURE_WRITE_MKB               (48U)
/**
 * @}
 */

/**
 * @defgroup SDMMC_Error_Code SDMMC Error Code
 * @{
 */
#define SDMMC_ERROR_NONE                        (0x00000000UL)  /*!< No error                                                      */
#define SDMMC_ERROR_ADDR_OUT_OF_RANGE           (0x80000000UL)  /*!< Error when addressed block is out of range                    */
#define SDMMC_ERROR_ADDR_MISALIGNED             (0x40000000UL)  /*!< Misaligned address                                            */
#define SDMMC_ERROR_BLOCK_LEN_ERR               (0x20000000UL)  /*!< Transferred block length is not allowed for the card or the    \
                                                                     number of transferred bytes does not match the block length   */
#define SDMMC_ERROR_ERASE_SEQ_ERR               (0x10000000UL)  /*!< An error in the sequence of erase command occurs              */
#define SDMMC_ERROR_BAD_ERASE_PARAM             (0x08000000UL)  /*!< An invalid selection for erase groups                         */
#define SDMMC_ERROR_WRITE_PROT_VIOLATION        (0x04000000UL)  /*!< Attempt to program a write protect block                      */
#define SDMMC_ERROR_LOCK_UNLOCK_FAILED          (0x01000000UL)  /*!< Sequence or password error has been detected in unlock command \
                                                                     or if there was an attempt to access a locked card            */
#define SDMMC_ERROR_COM_CRC_FAILED              (0x00800000UL)  /*!< CRC check of the previous command failed                      */
#define SDMMC_ERROR_ILLEGAL_CMD                 (0x00400000UL)  /*!< Command is not legal for the card state                       */
#define SDMMC_ERROR_CARD_ECC_FAILED             (0x00200000UL)  /*!< Card internal ECC was applied but failed to correct the data  */
#define SDMMC_ERROR_CC_ERR                      (0x00100000UL)  /*!< Internal card controller error                                */
#define SDMMC_ERROR_GENERAL_UNKNOWN_ERR         (0x00080000UL)  /*!< General or unknown error                                      */
#define SDMMC_ERROR_STREAM_READ_UNDERRUN        (0x00040000UL)  /*!< The card could not sustain data reading in stream rmode       */
#define SDMMC_ERROR_STREAM_WRITE_OVERRUN        (0x00020000UL)  /*!< The card could not sustain data programming in stream mode    */
#define SDMMC_ERROR_CID_CSD_OVERWRITE           (0x00010000UL)  /*!< CID/CSD overwrite error                                       */
#define SDMMC_ERROR_WP_ERASE_SKIP               (0x00008000UL)  /*!< Only partial address space was erased                         */
#define SDMMC_ERROR_CARD_ECC_DISABLED           (0x00004000UL)  /*!< Command has been executed without using internal ECC          */
#define SDMMC_ERROR_ERASE_RESET                 (0x00002000UL)  /*!< Erase sequence was cleared before executing because an out of  \
                                                                     erase sequence command was received                           */
#define SDMMC_ERROR_CMD_AUTO_SEND               (0x00001000UL)  /*!< An error occurred in sending the command automatically        */
#define SDMMC_ERROR_CMD_INDEX                   (0x00000800UL)  /*!< The received response contains a command number error         */
#define SDMMC_ERROR_CMD_STOP_BIT                (0x00000400UL)  /*!< Command line detects low level at stop bit                    */
#define SDMMC_ERROR_CMD_CRC_FAIL                (0x00000200UL)  /*!< Command response received (but CRC check failed)              */
#define SDMMC_ERROR_CMD_TIMEOUT                 (0x00000100UL)  /*!< Command response timeout                                      */
#define SDMMC_ERROR_SWITCH_ERROR                (0x00000080UL)  /*!< The card did not switch to the expected mode as requested by   \
                                                                     the SWITCH command                                            */
#define SDMMC_ERROR_DATA_STOP_BIT               (0x00000040UL)  /*!< Data line detects low level at stop bit                       */
#define SDMMC_ERROR_DATA_CRC_FAIL               (0x00000020UL)  /*!< Data block sent/received (CRC check failed)                   */
#define SDMMC_ERROR_DATA_TIMEOUT                (0x00000010UL)  /*!< Data timeout                                                  */
#define SDMMC_ERROR_AKE_SEQ_ERR                 (0x00000008UL)  /*!< Error in sequence of authentication                           */
#define SDMMC_ERROR_INVALID_VOLTRANGE           (0x00000004UL)  /*!< Error in case of invalid voltage range                        */
#define SDMMC_ERROR_REQUEST_NOT_APPLICABLE      (0x00000002UL)  /*!< Error when command request is not applicable                  */
#define SDMMC_ERROR_UNSUPPORTED_FEATURE         (0x00000001UL)  /*!< Error when feature is not insupported                         */

#define SDMMC_CARD_ERROR_BITS_MASK              (0xFDFFE048UL)  /*!< SD/MMC Error status bits mask                                 */
/**
 * @}
 */

/**
 * @defgroup SDMMC_Card_Status_Bit SDMMC Card Status Bit
 * @{
 */
#define SDMMC_STATUS_CARD_IS_LOCKED_POS         (24U)
#define SDMMC_STATUS_CARD_IS_LOCKED             (0x02000000UL)  /*!< When set, signals that the card is locked by the host */
#define SDMMC_STATUS_CURRENT_STATE_POS          (9U)
#define SDMMC_STATUS_CURRENT_STATE              (0x00001E00UL)  /*!< The state of the card when receiving the command */
#define SDMMC_STATUS_READY_FOR_DATA_POS         (8U)
#define SDMMC_STATUS_READY_FOR_DATA             (0x00000100UL)  /*!< Corresponds to buffer empty signaling on the bus */
#define SDMMC_STATUS_APP_CMD_POS                (5U)
#define SDMMC_STATUS_APP_CMD                    (0x00000020UL)  /*!< The card will expect ACMD, or an indication that the command has been interpreted as ACMD */
/**
 * @}
 */

/**
 * @defgroup SDMMC_SCR_Register SDMMC SCR Register
 * @{
 */
#define SDMMC_SCR_PHY_SPEC_VER_1P0              (0x00000000UL)
#define SDMMC_SCR_PHY_SPEC_VER_1P1              (0x01000000UL)
#define SDMMC_SCR_PHY_SPEC_VER_2P0              (0x02000000UL)
#define SDMMC_SCR_BUS_WIDTH_4BIT                (0x00040000UL)
#define SDMMC_SCR_BUS_WIDTH_1BIT                (0x00010000UL)
/**
 * @}
 */

/**
 * @defgroup SDMMC_OCR_Register SDMMC OCR Register
 * @{
 */
#define SDMMC_OCR_HIGH_CAPACITY                 (0x40000000UL)
#define SDMMC_OCR_STD_CAPACITY                  (0x00000000UL)
/**
 * @}
 */

/**
 * @defgroup SDMMC_CSD_Register SDMMC CSD Register
 * @{
 */
/* Command Class supported */
#define SDMMC_CSD_SUPPORT_CLASS5_ERASE          (0x00000020UL)
/**
 * @}
 */

/**
 * @defgroup SDMMC_Common_Parameter SDMMC Common Parameter
 * @{
 */
#define SDMMC_DATA_TIMEOUT                      (0x0000FFFFUL)
#define SDMMC_MAX_VOLTAGE_TRIAL                 (0x0000FFFFUL)
/**
 * @}
 */

/**
 * @}
 */

